app/views/carts/_cart.html.erb

<div class="modal-body">
  <% if cart.line_items_in_stock.size > 0 %>
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 980190962