app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items`
---
  def index
    @line_items = LineItem.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 05 Jun 2014 17:50:22 UTC +00:00], ["updated_at", Thu, 05 Jun 2014 17:50:22 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Thu, 05 Jun 2014 17:50:23 UTC +00:00], ["product_id", 207281424], ["updated_at", Thu, 05 Jun 2014 17:50:23 UTC +00:00]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(product: product) #LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save