app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2014-06-08 00:09:01', 'Wibbles are fun!', 'lorem.jpg', 19.95, 'Lorem Ipsum', '2014-06-08 00:09:01')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `title` = 'Lorem Ipsum', `description` = 'Wibbles are fun!', `image_url` = 'lorem.jpg', `price` = 19.95, `updated_at` = '2014-06-08 00:09:02' WHERE `products`.`id` = 980190962